IDENTIFICATION DIVISION.
PROGRAM-ID. BANQUE-TEST.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  NOM-CLIENT        PIC X(20) VALUE "JEAN DUPONT".
01  SOLDE-COMPTE      PIC 9(05) VALUE 1000.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY "---------------------------------".
    DISPLAY "DEMARRAGE SYSTEME BANCAIRE V1.0".
    DISPLAY "CLIENT : " NOM-CLIENT.
    DISPLAY "SOLDE  : " SOLDE-COMPTE " EUR".
    DISPLAY "---------------------------------".
    STOP RUN.
    