IDENTIFICATION DIVISION.
PROGRAM-ID. INIT-DB.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT FICHIER-ENTREE ASSIGN TO "../data/input.txt"
    ORGANIZATION IS LINE SEQUENTIAL.

    SELECT FICHIER-SORTIE ASSIGN TO "reponse.txt"
    ORGANIZATION IS SEQUENTIAL.

    SELECT FICHIER-CLIENTS ASSIGN TO "../data/clients.dat"
    ORGANIZATION IS INDEXED
    ACCESS MODE IS RANDOM
    RECORD KEY IS DB-ID.

DATA DIVISION.
FILE SECTION.
FD FICHIER-CLIENTS.
01 CLIENT-ENREGISTREMENT.
    05 CLIENT-ID       PIC X(10).
    05 CLIENT-NOM      PIC X(20).
    05 CLIENT-SOLDE    PIC 9(10)V99.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    OPEN OUTPUT FICHIER-CLIENTS.

    DISPLAY "Creation du compte 12345...".
    MOVE "12345"       TO CLIENT-ID.
    MOVE "ELON MUSK"   TO CLIENT-NOM.
    MOVE 1000.00       TO CLIENT-SOLDE.
    
    WRITE CLIENT-ENREGISTREMENT
        INVALID KEY DISPLAY "ERREUR: Client existe deja !"
        NOT INVALID KEY DISPLAY "SUCCES: Elon Musk ajoute (1000.00 EUR)".

    DISPLAY "Creation du compte 67890...".
    MOVE "67890"       TO CLIENT-ID.
    MOVE "JEFF BEZOS"  TO CLIENT-NOM.
    MOVE 50.00         TO CLIENT-SOLDE.

    WRITE CLIENT-ENREGISTREMENT
        NOT INVALID KEY DISPLAY "SUCCES: Jeff Bezos ajoute (50.00 EUR)".

    CLOSE FICHIER-CLIENTS.
    STOP RUN.